# Questions

## 1. Merge orders data
## 2. Export merged orders data
## 3. Import merged order data
## 4. Check the shape of imported data
## 5. Combine 'orders_products_combined' with 'products' data
## 6. Confirm the results using the merge flag
## 7. Export the merged data

### Import libraries

In [2]:
# Importing libraries

import pandas as pd
import numpy as np
import os

### 1. See Task 4.6 Part 1 Notebook

### 2. See Task 4.6 Part 1 Notebook

### 3. Import data

In [3]:
# Path shortcut
path = r'/Users/lynnsey/Desktop/Bootcamp/Tasks/Immersion/Task 4/07-20-2023 Instacart Basket Analysis'

In [10]:
# Import orders data
df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

### 4. Check shape of imported data

In [11]:
# Checking shape of imported data; shape matches

df_orders_products_combined.shape

(32434489, 10)

### 5. Combine 'orders_products_combined' with 'products_checked_wrangled' data

#### Step 1: Import the products data

In [12]:
# Import 'products_checked_wrangled' data

df_products_checked_wrangled = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked_wrangled.csv'), index_col = False)

In [13]:
# Checking output of products data

df_products_checked_wrangled.head()

,Unnamed: 0.1,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,1,2,All-Seasons Salt,104,13,9.3
2,2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [14]:
# Removing unnamed column 0.1

df_products_checked_wrangled = df_products_checked_wrangled.drop("Unnamed: 0.1", axis=1)

In [15]:
# Removing unnamed column 0

df_products_checked_wrangled = df_products_checked_wrangled.drop("Unnamed: 0", axis=1)

In [16]:
# Checking output of products data

df_products_checked_wrangled.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [17]:
df_products_checked_wrangled.shape

(49672, 5)

#### Step 2: Check for key between data sets.
#### They match at 'product_id'.

In [18]:
# Looking at 'df_orders_products_combined' data

df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,time_ordered,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [19]:
# Looking at 'df_products_checked_wrangled' data

df_products_checked_wrangled.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

#### Step 3: Remove merge flag from 'df_orders_products_combined' data (so as not to confuse myself when adding a new merged flag in)

In [25]:
# Remove merge flag

df_orders_products_combined = df_orders_products_combined.drop("_merge", axis=1)

In [26]:
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,time_ordered,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

#### Step 4: Merge the two data sets

In [27]:
df_merged = df_orders_products_combined.merge(df_products_checked_wrangled, on = 'product_id', indicator = True)

### 6. Confirm the results using the merge flag

In [28]:
# Checking merge and confirming merge flag

df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,time_ordered,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [29]:
# checking if all data appeared in both dataframes

df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

### 7. Export the merged data

In [30]:
# Export data to pkl

df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))